===============================================================================
Paragraph: two
===============================================================================
First

Second

-------------------------------------------------------------------------------

(document
  (paragraph)
  (paragraph))

===============================================================================
Paragraph: two multiline
===============================================================================
In
First

In
Second

-------------------------------------------------------------------------------

(document
  (paragraph)
  (paragraph))

===============================================================================
Heading: multiple lines
===============================================================================
# Heading
# with
# lines

A paragraph

-------------------------------------------------------------------------------

(document
  (section
    (heading1
      (marker)
      (content
        (marker)
        (marker)))
    (section_content (paragraph))))

===============================================================================
Heading: multiple lines no # prefix
===============================================================================
# Heading
with
lines

A paragraph

-------------------------------------------------------------------------------

(document
  (section
    (heading1
      (marker)
      (content
        (marker)
        (marker)))
    (section_content (paragraph))))

===============================================================================
Heading: closed by higher heading on the next line
===============================================================================
# One
## Two

-------------------------------------------------------------------------------

(document
  (section
    (heading1
      (marker)
      (content))
    (section_content
      (section
        (heading2
          (marker)
          (content))))))

===============================================================================
Heading: closed by lower heading on the next line
===============================================================================
## One
# Two

-------------------------------------------------------------------------------

(document
  (section
    (heading2
      (marker)
      (content)))
  (section
    (heading1
      (marker)
      (content))))

===============================================================================
Heading 4: div closes
===============================================================================
:::
#### Heading
:::

stop

-------------------------------------------------------------------------------

(document
  (div
    (div_marker_begin)
    (content
      (heading4 (marker) (content)))
    (div_marker_end))
  (paragraph))

===============================================================================
Heading 6: list closes
===============================================================================
###### Heading
- a

-------------------------------------------------------------------------------

(document
  (section
    (heading6 (marker) (content))
    (section_content
      (list
        (list_item
          (list_marker_dash)
          (list_item_content (paragraph)))))))

===============================================================================
Block quote: long
===============================================================================
> This is a block quote.
>
> This is included

-------------------------------------------------------------------------------

(document
  (block_quote
    (block_quote_marker)
    (content
      (paragraph)
      (block_quote_marker)
      (block_quote_marker)
      (paragraph))))

===============================================================================
Block quote: with hard line break
===============================================================================
> a \
> b

-------------------------------------------------------------------------------

(document
  (block_quote
    (block_quote_marker)
    (content
      (paragraph
        (hard_line_break
          (block_quote_marker))))))

===============================================================================
Code block: empty
===============================================================================
```
```

-------------------------------------------------------------------------------

(document
  (code_block
    (code_block_marker_begin)
    (code_block_marker_end)))

===============================================================================
Block attribute: key value spaces
===============================================================================
{author="with spaces"}
Paragraph

-------------------------------------------------------------------------------

(document
  (block_attribute
    (args
      (key_value
        (key)
        (value))))
  (paragraph))

===============================================================================
Inline attribute: with newlines
===============================================================================
text{.one
.two
#three}

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_attribute
      (args
        (class)
        (class)
        (identifier)))))

===============================================================================
Hard line break
===============================================================================
With \
break

-------------------------------------------------------------------------------

(document
  (paragraph
    (hard_line_break)))

===============================================================================
Div: end paragraph inside
===============================================================================
:::
Inside
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker_begin)
    (content
      (paragraph))
    (div_marker_end)))

===============================================================================
Verbatim: newline closes
===============================================================================
`verbatim

-------------------------------------------------------------------------------

(document
  (paragraph
    (verbatim
      (verbatim_marker_begin)
      (content)
      (verbatim_marker_end))))

===============================================================================
List: tight dashes
===============================================================================
- a
- b
- c

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_dash)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_dash)
      (list_item_content (paragraph)))))

===============================================================================
List: Close sublist
===============================================================================
- a

  - b

- c

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content
        (paragraph)
        (list
          (list_item
            (list_marker_dash)
            (list_item_content
              (paragraph))))))
    (list_item
      (list_marker_dash)
      (list_item_content (paragraph)))))

===============================================================================
List: Continue paragraph with soft break
===============================================================================
- First
 Second

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content (paragraph)))))

===============================================================================
List: Immediate blockquote
===============================================================================
- > a
  > b

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content
        (block_quote
          (block_quote_marker)
          (content
            (paragraph
              (block_quote_marker))))))))

===============================================================================
Table: inside blockquote
===============================================================================
> | x|y|
> |--|--:|
> | a | b |

-------------------------------------------------------------------------------

(document
  (block_quote
    (block_quote_marker)
    (content
      (table
        (table_header
          (table_cell)
          (table_cell))
        (table_separator
          (block_quote_marker)
          (table_cell_alignment)
          (table_cell_alignment))
        (table_row
          (block_quote_marker)
          (table_cell)
          (table_cell))))))

