===============================================================================
Emphasis
===============================================================================
With _em_

-------------------------------------------------------------------------------

(inline
  (emphasis
    (emphasis_begin)
    (content)
    (emphasis_end)))

===============================================================================
Verbatim: single
===============================================================================
Simple `verbatim` here

-------------------------------------------------------------------------------

(document
  (paragraph
    (verbatim
      (verbatim_marker_begin)
      (content)
      (verbatim_marker_end))))

===============================================================================
Verbatim: double with single inside
===============================================================================
``verbatim with a backtick ` characters``

-------------------------------------------------------------------------------

(document
  (paragraph
    (verbatim
      (verbatim_marker_begin)
      (content)
      (verbatim_marker_end))))

===============================================================================
Verbatim: with triple inside
===============================================================================
`verbatim with three backtick ``` characters`

-------------------------------------------------------------------------------

(document
  (paragraph
    (verbatim
      (verbatim_marker_begin)
      (content)
      (verbatim_marker_end))))

===============================================================================
Verbatim: newline closes
===============================================================================
`verbatim

-------------------------------------------------------------------------------

(document
  (paragraph
    (verbatim
      (verbatim_marker_begin)
      (content)
      (verbatim_marker_end))))

===============================================================================
Verbatim: can contain newlines
===============================================================================
`verbatim
with
newlines`

trailing

-------------------------------------------------------------------------------

(document
  (paragraph
    (verbatim
      (verbatim_marker_begin)
      (content)
      (verbatim_marker_end)))
  (paragraph))


===============================================================================
Verbatim: multiple
===============================================================================
`x` `y`

-------------------------------------------------------------------------------

(document
  (paragraph
    (verbatim
      (verbatim_marker_begin)
      (content)
      (verbatim_marker_end))
    (verbatim
      (verbatim_marker_begin)
      (content)
      (verbatim_marker_end))))

===============================================================================
Verbatim: with hash
===============================================================================
Don't consume `#` in heading parser code

-------------------------------------------------------------------------------

(document
  (paragraph
    (verbatim
      (verbatim_marker_begin)
      (content)
      (verbatim_marker_end))))

===============================================================================
Paragraph: todo note fixme
===============================================================================
Higlight TODO NOTE and FIXME

-------------------------------------------------------------------------------

(document
  (paragraph (todo) (note) (fixme)))

===============================================================================
Smart punctuation
===============================================================================

Ellipsis...

Em---dash
Eh--dash

Some{"quotes"} be{'here'}yo

 \"Straight\" \'quotes\'

-------------------------------------------------------------------------------

(document
  (paragraph
    (ellipsis))
  (paragraph
    (em_dash)
    (en_dash))
  (paragraph
    (quotation_marks)
    (quotation_marks)
    (quotation_marks)
    (quotation_marks))
  (paragraph
    (quotation_marks)
    (quotation_marks)
    (quotation_marks)
    (quotation_marks)))

===============================================================================
Backslash escape
===============================================================================

No \_emphasis\_

No \_strong\_

No \<autolink>

Regular \.\.\. dots

Inside _x\_y_

No \{+insert\*}

\> no quote

-------------------------------------------------------------------------------

(document
  (paragraph (backslash_escape) (backslash_escape))
  (paragraph (backslash_escape) (backslash_escape))
  (paragraph (backslash_escape))
  (paragraph (backslash_escape) (backslash_escape) (backslash_escape))
  (paragraph (emphasis (emphasis_begin) (content (backslash_escape)) (emphasis_end)))
  (paragraph (backslash_escape) (backslash_escape))
  (paragraph (backslash_escape)))

===============================================================================
Image: inline
===============================================================================
![descr](/url)

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_image
      (image_description)
      (inline_link_destination))))

===============================================================================
Image: empty inline
===============================================================================
![](/url)

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_image
      (inline_link_destination))))

===============================================================================
Image: collapsed reference link
===============================================================================
![img][]

-------------------------------------------------------------------------------

(document
  (paragraph
    (collapsed_reference_image
      (image_description))))

===============================================================================
Image: full reference
===============================================================================
![descr][ref]

-------------------------------------------------------------------------------

(document
  (paragraph
    (full_reference_image
      (image_description)
      (link_label))))

===============================================================================
Emphasis
===============================================================================
With _emphasis_ here

-------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis (emphasis_begin) (content) (emphasis_end))))

===============================================================================
Strong
===============================================================================
With *strong* here

-------------------------------------------------------------------------------

(document
  (paragraph
    (strong (strong_begin) (content) (strong_end))))

===============================================================================
Emphasis and strong
===============================================================================
With _*strong* emphasis_ here

With *_emphasis_ strong* here

-------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (emphasis_begin)
      (content (strong (strong_begin) (content) (strong_end)))
      (emphasis_end)))
  (paragraph
    (strong
      (strong_begin)
      (content (emphasis (emphasis_begin) (content) (emphasis_end)))
      (strong_end))))

===============================================================================
Emphasis and strong two chars
===============================================================================
*bc a*
_bc a_

-------------------------------------------------------------------------------

(document
  (paragraph
    (strong
      (strong_begin)
      (content)
      (strong_end))
    (emphasis
      (emphasis_begin)
      (content)
      (emphasis_end))))

===============================================================================
Emphasis and strong with newlines
===============================================================================
*a
b*
_a
b_

-------------------------------------------------------------------------------

(document
  (paragraph
    (strong
      (strong_begin)
      (content)
      (strong_end))
    (emphasis
      (emphasis_begin)
      (content)
      (emphasis_end))))

===============================================================================
Emphasis: various weird tests
===============================================================================
_a b c_

_a b_

_a_

_a
b c_

_ai
b c_

_a
b
c_

_a
b_

_ab
cd_

_ab
x
cd_

-------------------------------------------------------------------------------

(document
  (paragraph (emphasis (emphasis_begin) (content) (emphasis_end)))
  (paragraph (emphasis (emphasis_begin) (content) (emphasis_end)))
  (paragraph (emphasis (emphasis_begin) (content) (emphasis_end)))
  (paragraph (emphasis (emphasis_begin) (content) (emphasis_end)))
  (paragraph (emphasis (emphasis_begin) (content) (emphasis_end)))
  (paragraph (emphasis (emphasis_begin) (content) (emphasis_end)))
  (paragraph (emphasis (emphasis_begin) (content) (emphasis_end)))
  (paragraph (emphasis (emphasis_begin) (content) (emphasis_end)))
  (paragraph (emphasis (emphasis_begin) (content) (emphasis_end))))

===============================================================================
Superscipt: various weird tests
===============================================================================
^a b c^

^a b^

^a^

^a
b c^

^ai
b c^

^a
b
c^

^a
b^

^ab
cd^

^ab
x
cd^

-------------------------------------------------------------------------------

(document
  (paragraph (superscript (content)))
  (paragraph (superscript (content)))
  (paragraph (superscript (content)))
  (paragraph (superscript (content)))
  (paragraph (superscript (content)))
  (paragraph (superscript (content)))
  (paragraph (superscript (content)))
  (paragraph (superscript (content)))
  (paragraph (superscript (content))))

===============================================================================
Emphasis: nested
===============================================================================
With __nested_ emphasis_

-------------------------------------------------------------------------------

(document
  (paragraph
    (emphasis
      (emphasis_begin)
      (content (emphasis (emphasis_begin) (content) (emphasis_end)))
      (emphasis_end))))

===============================================================================
Emphasis: forced despite spaces
===============================================================================
{_yes_}

{_ yes _}

_yes _}

{_ yes_}

-------------------------------------------------------------------------------

(document
  (paragraph (emphasis (emphasis_begin) (content) (emphasis_end)))
  (paragraph (emphasis (emphasis_begin) (content) (emphasis_end)))
  (paragraph (emphasis (emphasis_begin) (content) (emphasis_end)))
  (paragraph (emphasis (emphasis_begin) (content) (emphasis_end))))

===============================================================================
Strong: forced despite spaces
===============================================================================
{*yes*}

*yes *}

{* yes*

{* yes *}

-------------------------------------------------------------------------------

(document
  (paragraph (strong (strong_begin) (content) (strong_end)))
  (paragraph (strong (strong_begin) (content) (strong_end)))
  (paragraph (strong (strong_begin) (content) (strong_end)))
  (paragraph (strong (strong_begin) (content) (strong_end))))

===============================================================================
Subscript
===============================================================================
~sub~

{~many sub~}

-------------------------------------------------------------------------------

(document
  (paragraph (subscript (content)))
  (paragraph (subscript (content))))

===============================================================================
Superscript
===============================================================================
^sup^

{^many sup^}

-------------------------------------------------------------------------------

(document
  (paragraph (superscript (content)))
  (paragraph (superscript (content))))

===============================================================================
Highlighted
===============================================================================
With {=mark=} here

-------------------------------------------------------------------------------

(document
  (paragraph
    (highlighted (content))))

===============================================================================
Insert
===============================================================================
With {+insert+} here

-------------------------------------------------------------------------------

(document
  (paragraph
    (insert (content))))

===============================================================================
Delete
===============================================================================
With {-delete-} here

-------------------------------------------------------------------------------

(document
  (paragraph
    (delete (content))))

===============================================================================
Inline with newlines
===============================================================================
{=a
b=}

{+a
b+}

{-a
b-}

^a
b^

~a
b~

-------------------------------------------------------------------------------

(document
  (paragraph
    (highlighted
      (content)))
  (paragraph
    (insert
      (content)))
  (paragraph
    (delete
      (content)))
  (paragraph
    (superscript
      (content)))
  (paragraph
    (subscript
      (content))))

===============================================================================
Hard line break
===============================================================================
With \
break

-------------------------------------------------------------------------------

(document
  (paragraph
    (hard_line_break)))

===============================================================================
Symbol
===============================================================================
With :wink: here

-------------------------------------------------------------------------------

(document
  (paragraph
    (symbol)))

===============================================================================
Link: inline
===============================================================================
With [link](/url)

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_link
      (link_text)
      (inline_link_destination))))

===============================================================================
Link: with newline
===============================================================================
With [link
newline](/url)

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_link
      (link_text)
      (inline_link_destination))))

===============================================================================
Link: begin
===============================================================================
[link](/url)

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_link
      (link_text)
      (inline_link_destination))))

===============================================================================
Link: collapsed reference link
===============================================================================
With [a reference][]

-------------------------------------------------------------------------------

(document
  (paragraph
    (collapsed_reference_link
      (link_text))))

===============================================================================
Link: full reference single
===============================================================================
With [a reference][ref]

-------------------------------------------------------------------------------

(document
  (paragraph
    (full_reference_link
      (link_text)
      (link_label))))

===============================================================================
Link: full reference
===============================================================================
With [a reference][ref]

[ref]: /url

-------------------------------------------------------------------------------

(document
  (paragraph
    (full_reference_link
      (link_text)
      (link_label)))
  (link_reference_definition
    (link_label)
    (link_destination)))

===============================================================================
Inline attribute: mixed
===============================================================================
text{.one .two #id author="with spaces"}

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_attribute
      (args
        (class)
        (class)
        (identifier)
        (key_value
          (key)
          (value))))))

===============================================================================
Inline attribute: casing
===============================================================================
text{.snake_case .cebab-case}

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_attribute
      (args
        (class)
        (class)))))

===============================================================================
Inline attribute: key casing
===============================================================================
text{snake_case=2 kebab-case=3}

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_attribute
      (args
        (key_value
          (key)
          (value))
        (key_value
          (key)
          (value))))))

===============================================================================
Inline attribute: surrounding spaces
===============================================================================
text{ .class }

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_attribute
      (args
        (class)))))

===============================================================================
Inline attribute: with newlines
===============================================================================
text{.one
.two
#three}

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_attribute
      (args
        (class)
        (class)
        (identifier)))))

===============================================================================
Inline attribute: with comment
===============================================================================
text{#ident % later we'll add a class %}

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_attribute
      (args
        (identifier)
        (comment
          (content))))))

===============================================================================
Inline attribute: comment
===============================================================================
text{%
some text here
%}

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_attribute
      (args
        (comment
          (content))))))

===============================================================================
Inline attribute: standalone comment
===============================================================================
Foo bar {% This is a comment, spanning
multiple lines %} baz.

-------------------------------------------------------------------------------

(document
  (paragraph
    (comment
      (content))))

===============================================================================
Inline attribute: comment escape %
===============================================================================
Before {% escape \% %}

-------------------------------------------------------------------------------

(document
  (paragraph
    (comment
      (content
        (backslash_escape)))))

===============================================================================
Inline attribute: mixed comment escape %
===============================================================================
Before{#id % escape \% %}

-------------------------------------------------------------------------------

(document
  (paragraph
    (inline_attribute
      (args
        (identifier)
        (comment
          (content
            (backslash_escape)))))))

===============================================================================
Span
===============================================================================
One [two three]{.class
#id}

-------------------------------------------------------------------------------

(document
  (paragraph
    (span
      (inline_attribute
        (args
          (class)
          (identifier))))))

===============================================================================
Autolink
===============================================================================
With </url> link

-------------------------------------------------------------------------------

(document
  (paragraph
    (autolink)))

===============================================================================
Footnote: reference
===============================================================================

Here's a ref.[^foo]

-------------------------------------------------------------------------------

(document
  (paragraph
    (footnote_reference
      (footnote_marker_begin)
      (reference_label)
      (footnote_marker_end))))

===============================================================================
Raw inline
===============================================================================
`<? php echo 'yoyo' ?>`{=html}

-------------------------------------------------------------------------------

(document
  (paragraph
    (raw_inline
      (raw_inline_marker_begin)
      (content)
      (raw_inline_marker_end)
      (raw_inline_attribute
        (language)))))

===============================================================================
Math
===============================================================================
$`1 + 2`

-------------------------------------------------------------------------------

(document
  (paragraph
    (math
      (math_marker)
      (math_marker_begin)
      (content)
      (math_marker_end))))

