===============================================================================
Verbatim: single
===============================================================================
Simple `verbatim` here

-------------------------------------------------------------------------------

(inline
  (verbatim
    (verbatim_marker_begin)
    (content)
    (verbatim_marker_end)))

===============================================================================
Verbatim: with emphasis inside
===============================================================================
Simple `x _a_` here

-------------------------------------------------------------------------------

(inline
  (verbatim
    (verbatim_marker_begin)
    (content)
    (verbatim_marker_end)))

===============================================================================
Verbatim: double with single inside
===============================================================================
``verbatim with a backtick ` characters``

-------------------------------------------------------------------------------

(inline
  (verbatim
    (verbatim_marker_begin)
    (content)
    (verbatim_marker_end)))

===============================================================================
Verbatim: with triple inside
===============================================================================
`verbatim with three backtick ``` characters`

-------------------------------------------------------------------------------

(inline
  (verbatim
    (verbatim_marker_begin)
    (content)
    (verbatim_marker_end)))

===============================================================================
Verbatim: newline closes
===============================================================================
`verbatim

-------------------------------------------------------------------------------

(inline
  (verbatim
    (verbatim_marker_begin)
    (content)
    (verbatim_marker_end)))

===============================================================================
Verbatim: can contain newlines
===============================================================================
`verbatim
with
newlines`

-------------------------------------------------------------------------------

(inline
  (verbatim
    (verbatim_marker_begin)
    (content)
    (verbatim_marker_end)))


===============================================================================
Verbatim: multiple
===============================================================================
`x` `y`

-------------------------------------------------------------------------------

(inline
  (verbatim
    (verbatim_marker_begin)
    (content)
    (verbatim_marker_end))
  (verbatim
    (verbatim_marker_begin)
    (content)
    (verbatim_marker_end)))

===============================================================================
Verbatim: with hash
===============================================================================
Don't consume `#` in heading parser code

-------------------------------------------------------------------------------

(inline
  (verbatim
    (verbatim_marker_begin)
    (content)
    (verbatim_marker_end)))

===============================================================================
Paragraph: todo note fixme
===============================================================================
Higlight TODO NOTE and FIXME

-------------------------------------------------------------------------------

(inline (todo) (note) (fixme))

===============================================================================
Smart punctuation
===============================================================================

Ellipsis...
Em---dash
Eh--dash
Some{"quotes"} be{'here'}yo
 \"Straight\" \'quotes\'

-------------------------------------------------------------------------------

(inline
  (ellipsis)
    (em_dash)
    (en_dash)
    (quotation_marks)
    (quotation_marks)
    (quotation_marks)
    (quotation_marks)
    (quotation_marks)
    (quotation_marks)
    (quotation_marks)
    (quotation_marks))

===============================================================================
Backslash escape
===============================================================================

No \_emphasis\_
No \_strong\_
No \<autolink>
Regular \.\.\. dots
Inside _x\_y_
No \{+insert\*}
\> no quote
\\
\ whitespace

-------------------------------------------------------------------------------

(inline
  (backslash_escape) (backslash_escape)
  (backslash_escape) (backslash_escape)
  (backslash_escape)
  (backslash_escape) (backslash_escape) (backslash_escape)
  (emphasis (emphasis_begin) (content (backslash_escape)) (emphasis_end))
  (backslash_escape) (backslash_escape)
  (backslash_escape)
  (backslash_escape)
  (backslash_escape))

===============================================================================
Image: inline with nested emphasis
===============================================================================
![descr](1_2_3_4_5)

-------------------------------------------------------------------------------

(inline
  (inline_image
    (image_description)
    (inline_link_destination)))

===============================================================================
Image: inline
===============================================================================
![descr](/url)

-------------------------------------------------------------------------------

(inline
  (inline_image
    (image_description)
    (inline_link_destination)))

===============================================================================
Image: empty inline
===============================================================================
![](/url)

-------------------------------------------------------------------------------

(inline
  (inline_image
    (image_description)
    (inline_link_destination)))

===============================================================================
Image: collapsed reference link
===============================================================================
![img][]

-------------------------------------------------------------------------------

(inline
  (collapsed_reference_image
    (image_description)))

===============================================================================
Image: full reference
===============================================================================
![descr][ref]

-------------------------------------------------------------------------------

(inline
  (full_reference_image
    (image_description)
    (link_label)))

===============================================================================
Image: inline precedence 1
===============================================================================
![x *](y)*

-------------------------------------------------------------------------------

(inline
  (inline_image
    (image_description)
    (inline_link_destination)))

===============================================================================
Image: inline precedence 2
===============================================================================
*![*](y)

-------------------------------------------------------------------------------

(inline
  (strong
    (strong_begin)
    (content)
    (strong_end)))

===============================================================================
Image: inline precedence 3
===============================================================================
*![x](y*)

-------------------------------------------------------------------------------

(inline
  (strong
    (strong_begin)
    (content)
    (strong_end)))

===============================================================================
Image: full precedence 1
===============================================================================
![x *][y]*

-------------------------------------------------------------------------------

(inline
  (full_reference_image
    (image_description)
    (link_label)))

===============================================================================
Image: full precedence 2
===============================================================================
*![*][y]

-------------------------------------------------------------------------------

(inline
  (strong
    (strong_begin)
    (content)
    (strong_end)))

===============================================================================
Image: full precedence 3
===============================================================================
*![x][y*]

-------------------------------------------------------------------------------

(inline
  (strong
    (strong_begin)
    (content)
    (strong_end)))

===============================================================================
Image: collapsed precedence 1
===============================================================================
![x *][]*

-------------------------------------------------------------------------------

(inline
  (collapsed_reference_image
    (image_description)))

===============================================================================
Image: collapsed precedence 2
===============================================================================
*![*][]

-------------------------------------------------------------------------------

(inline
  (strong
    (strong_begin)
    (content)
    (strong_end)))

===============================================================================
Image: collapsed precedence 3
===============================================================================
*![x][*]

-------------------------------------------------------------------------------

(inline
  (strong
    (strong_begin)
    (content)
    (strong_end)))


===============================================================================
Image: inline
===============================================================================
![descr](/url)

-------------------------------------------------------------------------------

(inline
  (inline_image
    (image_description)
    (inline_link_destination)))

===============================================================================
Image: post precedence inline_link
===============================================================================
![x](y*)*

-------------------------------------------------------------------------------

(inline
  (inline_image
    (image_description)
    (inline_link_destination)))

===============================================================================
Image: post precedence full_reference_link
===============================================================================
![x][y*]*

-------------------------------------------------------------------------------

(inline
  (full_reference_image
    (image_description)
    (link_label)))

===============================================================================
Image: fallback
===============================================================================
![x](/u

-------------------------------------------------------------------------------

(inline)

===============================================================================
Emphasis
===============================================================================
With _em_

-------------------------------------------------------------------------------

(inline
  (emphasis
    (emphasis_begin)
    (content)
    (emphasis_end)))

===============================================================================
Strong
===============================================================================
With *strong* here

-------------------------------------------------------------------------------

(inline
  (strong (strong_begin) (content) (strong_end)))

===============================================================================
Mixed emphasis and strong
===============================================================================
With _*strong* emphasis_ here
With *_emphasis_ strong* here

-------------------------------------------------------------------------------

(inline
  (emphasis
    (emphasis_begin)
    (content (strong (strong_begin) (content) (strong_end)))
    (emphasis_end))
  (strong
    (strong_begin)
    (content (emphasis (emphasis_begin) (content) (emphasis_end)))
    (strong_end)))

===============================================================================
Emphasis and strong two chars
===============================================================================
*bc a*
_bc a_

-------------------------------------------------------------------------------

(inline
  (strong
    (strong_begin)
    (content)
    (strong_end))
  (emphasis
    (emphasis_begin)
    (content)
    (emphasis_end)))

===============================================================================
Emphasis and strong with newlines
===============================================================================
*a
b*
_a
b_

-------------------------------------------------------------------------------

(inline
  (strong
    (strong_begin)
    (content)
    (strong_end))
  (emphasis
    (emphasis_begin)
    (content)
    (emphasis_end)))

===============================================================================
Emphasis: three chars with spaces
===============================================================================
_a b c_

-------------------------------------------------------------------------------

(inline (emphasis (emphasis_begin) (content) (emphasis_end)))

===============================================================================
Emphasis: two chars with spaces
===============================================================================
_a b_

-------------------------------------------------------------------------------

(inline (emphasis (emphasis_begin) (content) (emphasis_end)))

===============================================================================
Emphasis: one char between
===============================================================================
_a_

-------------------------------------------------------------------------------

(inline (emphasis (emphasis_begin) (content) (emphasis_end)))

===============================================================================
Emphasis: three chars with a newline
===============================================================================
_a
b c_

-------------------------------------------------------------------------------

(inline (emphasis (emphasis_begin) (content) (emphasis_end)))


===============================================================================
Emphasis: three chars with a newline 2
===============================================================================
_ai
b c_

-------------------------------------------------------------------------------

(inline (emphasis (emphasis_begin) (content) (emphasis_end)))

===============================================================================
Emphasis: three chars with two newlines
===============================================================================
_a
b
c_

-------------------------------------------------------------------------------

(inline (emphasis (emphasis_begin) (content) (emphasis_end)))

===============================================================================
Emphasis: two chars with a newline
===============================================================================
_a
b_

-------------------------------------------------------------------------------

(inline (emphasis (emphasis_begin) (content) (emphasis_end)))

===============================================================================
Emphasis: two chars with a newline 2
===============================================================================
_ab
cd_

-------------------------------------------------------------------------------

(inline (emphasis (emphasis_begin) (content) (emphasis_end)))

===============================================================================
Emphasis: two chars with a newline 3
===============================================================================
_ab
x
cd_

-------------------------------------------------------------------------------

(inline (emphasis (emphasis_begin) (content) (emphasis_end)))

===============================================================================
Emphasis: Shorter span
===============================================================================

{_*s*{_b_

-------------------------------------------------------------------------------

(inline
  (strong (strong_begin) (content) (strong_end))
  (emphasis (emphasis_begin) (content) (emphasis_end)))

===============================================================================
Superscript: Shorter span
===============================================================================

{^*s*{^b^

-------------------------------------------------------------------------------

(inline
  (strong (strong_begin) (content) (strong_end))
  (superscript (superscript_begin) (content) (superscript_end)))

===============================================================================
Superscript: three chars with spaces
===============================================================================
^a b c^

-------------------------------------------------------------------------------

(inline
  (superscript
  (superscript_begin)
  (content)
  (superscript_end)))

===============================================================================
Superscript: two chars with spaces
===============================================================================
^a b^

-------------------------------------------------------------------------------

(inline
  (superscript
  (superscript_begin)
  (content)
  (superscript_end)))

===============================================================================
Superscript: one char between
===============================================================================
^a^

-------------------------------------------------------------------------------

(inline
  (superscript
  (superscript_begin)
  (content)
  (superscript_end)))

===============================================================================
Superscript: three chars with a newline
===============================================================================
^a
b c^

-------------------------------------------------------------------------------

(inline
  (superscript
  (superscript_begin)
  (content)
  (superscript_end)))


===============================================================================
Superscript: three chars with a newline 2
===============================================================================
^ai
b c^

-------------------------------------------------------------------------------

(inline
  (superscript
  (superscript_begin)
  (content)
  (superscript_end)))

===============================================================================
Superscript: three chars with a two newlines
===============================================================================
^a
b
c^

-------------------------------------------------------------------------------

(inline
  (superscript
  (superscript_begin)
  (content)
  (superscript_end)))

===============================================================================
Superscript: two chars with a newline
===============================================================================
^a
b^

-------------------------------------------------------------------------------

(inline
  (superscript
  (superscript_begin)
  (content)
  (superscript_end)))

===============================================================================
Superscript: two chars with a newline 2
===============================================================================
^ab
cd^

-------------------------------------------------------------------------------

(inline
  (superscript
  (superscript_begin)
  (content)
  (superscript_end)))

===============================================================================
Superscript: two chars with a newline 3
===============================================================================
^ab
x
cd^

-------------------------------------------------------------------------------

(inline
  (superscript
  (superscript_begin)
  (content)
  (superscript_end)))

===============================================================================
Emphasis: nested
===============================================================================
With __nested_ emphasis_

-------------------------------------------------------------------------------

(inline
  (emphasis
    (emphasis_begin)
    (content (emphasis (emphasis_begin) (content) (emphasis_end)))
    (emphasis_end)))

===============================================================================
Emphasis: forced despite spaces
===============================================================================
{_yes_}
{_ yes _}
_yes _}
{_ yes_}

-------------------------------------------------------------------------------

(inline
  (emphasis (emphasis_begin) (content) (emphasis_end))
  (emphasis (emphasis_begin) (content) (emphasis_end))
  (emphasis (emphasis_begin) (content) (emphasis_end))
  (emphasis (emphasis_begin) (content) (emphasis_end)))

===============================================================================
Emphasis: simple nested
===============================================================================
__a_ b_

-------------------------------------------------------------------------------

(inline
  (emphasis
    (emphasis_begin)
    (content
      (emphasis
        (emphasis_begin)
        (content)
        (emphasis_end)))
    (emphasis_end)))

===============================================================================
Emphasis: nested with spaces
===============================================================================
_a _b_ a_

-------------------------------------------------------------------------------

(inline
  (emphasis
    (emphasis_begin)
    (content
      (emphasis
        (emphasis_begin)
        (content)
        (emphasis_end)))
    (emphasis_end)))

===============================================================================
Emphasis: 2 not emphasis
===============================================================================
__ a

-------------------------------------------------------------------------------

(inline)

===============================================================================
Emphasis: 3 not emphasis
===============================================================================
___ a

-------------------------------------------------------------------------------

(inline)

===============================================================================
Emphasis: long not emphasis
===============================================================================
_________ a

-------------------------------------------------------------------------------

(inline)

===============================================================================
Emphasis: begin 2 not emphasis
===============================================================================
__a

-------------------------------------------------------------------------------

(inline)

===============================================================================
Emphasis: begin 3 not emphasis
===============================================================================
___a

-------------------------------------------------------------------------------

(inline)

===============================================================================
Emphasis: begin long not emphasis
===============================================================================
_________a

-------------------------------------------------------------------------------

(inline)

===============================================================================
Superscript: 2 not emphasis
===============================================================================
^^ a

-------------------------------------------------------------------------------

(inline)

===============================================================================
Superscript: 3 not emphasis
===============================================================================
^^^ a

-------------------------------------------------------------------------------

(inline)

===============================================================================
Superscript: long not emphasis
===============================================================================
^^^^^^^^^ a

-------------------------------------------------------------------------------

(inline)

===============================================================================
Superscript: begin 2 not emphasis
===============================================================================
^^a

-------------------------------------------------------------------------------

(inline)

===============================================================================
Superscript: begin 3 not emphasis
===============================================================================
^^^a

-------------------------------------------------------------------------------

(inline)

===============================================================================
Superscript: begin long not emphasis
===============================================================================
^^^^^^^^^a

-------------------------------------------------------------------------------

(inline)

===============================================================================
Strong: forced despite spaces
===============================================================================
{*yes*}
*yes *}
{* yes*
{* yes *}

-------------------------------------------------------------------------------

(inline
  (strong (strong_begin) (content) (strong_end))
  (strong (strong_begin) (content) (strong_end))
  (strong (strong_begin) (content) (strong_end))
  (strong (strong_begin) (content) (strong_end)))

===============================================================================
Subscript
===============================================================================
~sub~
{~many sub~}

-------------------------------------------------------------------------------

(inline
  (subscript (subscript_begin) (content) (subscript_end))
  (subscript (subscript_begin) (content) (subscript_end)))

===============================================================================
Superscript
===============================================================================
^sup^
{^many sup^}

-------------------------------------------------------------------------------

(inline
  (superscript
    (superscript_begin)
    (content)
    (superscript_end))
  (superscript
    (superscript_begin)
    (content)
    (superscript_end)))

===============================================================================
Highlighted
===============================================================================
With {=mark=} here

-------------------------------------------------------------------------------

(inline
  (highlighted
    (highlighted_begin)
    (content)
    (highlighted_end)))

===============================================================================
Highlighted: Shorter span
===============================================================================

{=*s*{=b=}

-------------------------------------------------------------------------------

(inline
  (strong (strong_begin) (content) (strong_end))
  (highlighted (highlighted_begin) (content) (highlighted_end)))

===============================================================================
Insert
===============================================================================
With {+insert+} here

-------------------------------------------------------------------------------

(inline
  (insert
    (insert_begin)
    (content)
    (insert_end)))

===============================================================================
Delete
===============================================================================
With {-delete-} here

-------------------------------------------------------------------------------

(inline
  (delete
  (delete_begin)
  (content)
  (delete_end)))

===============================================================================
Inline with newlines
===============================================================================
{=a
b=}
{+a
b+}
{-a
b-}
^a
b^
~a
b~

-------------------------------------------------------------------------------

(inline
  (highlighted
    (highlighted_begin)
    (content)
    (highlighted_end))
    (insert
      (insert_begin)
      (content)
      (insert_end))
    (delete
      (delete_begin)
      (content)
      (delete_end))
    (superscript
      (superscript_begin)
      (content)
      (superscript_end))
    (subscript
      (subscript_begin)
      (content)
      (subscript_end)))

===============================================================================
Hard line break
===============================================================================
With \
break

-------------------------------------------------------------------------------

(inline
  (hard_line_break))

===============================================================================
Symbol: Allowed characters
===============================================================================
With :wi_nk-12: here

-------------------------------------------------------------------------------

(inline
  (symbol))

===============================================================================
Symbol: No symbol characters
===============================================================================
With :win.k: here

-------------------------------------------------------------------------------

(inline)

===============================================================================
Link: inline
===============================================================================
With [link](/url)

-------------------------------------------------------------------------------

(inline
  (inline_link
    (link_text)
    (inline_link_destination)))

===============================================================================
Link: inline with nested emphasis
===============================================================================
With [link](1_2_3_4_5)

-------------------------------------------------------------------------------

(inline
  (inline_link
    (link_text)
    (inline_link_destination)))

===============================================================================
Link: with newline
===============================================================================
With [link
newline](/url)

-------------------------------------------------------------------------------

(inline
  (inline_link
    (link_text)
    (inline_link_destination)))

===============================================================================
Link: with url newline
===============================================================================
[text](url
here
go)

-------------------------------------------------------------------------------

(inline
  (inline_link
    (link_text)
    (inline_link_destination)))

===============================================================================
Link: begin
===============================================================================
[link](/url)

-------------------------------------------------------------------------------

(inline
  (inline_link
    (link_text)
    (inline_link_destination)))

===============================================================================
Link: collapsed reference link
===============================================================================
With [a reference][]

-------------------------------------------------------------------------------

(inline
  (collapsed_reference_link
    (link_text)))

===============================================================================
Link: full reference single
===============================================================================
With [a reference][ref]

-------------------------------------------------------------------------------

(inline
  (full_reference_link
    (link_text)
    (link_label)))

===============================================================================
Link: full reference
===============================================================================
With [a reference][ref]

-------------------------------------------------------------------------------

(inline
  (full_reference_link
    (link_text)
    (link_label)))

===============================================================================
Link: empty text inline
===============================================================================
[](y)

-------------------------------------------------------------------------------

(inline
  (inline_link
    (link_text)
    (inline_link_destination)))

===============================================================================
Link: inline precedence 1
===============================================================================
[x *](y)*

-------------------------------------------------------------------------------

(inline
  (inline_link
    (link_text)
    (inline_link_destination)))

===============================================================================
Link: inline precedence 2
===============================================================================
*[*](y)

-------------------------------------------------------------------------------

(inline
  (strong
    (strong_begin)
    (content)
    (strong_end)))

===============================================================================
Link: inline precedence 3
===============================================================================
*[x](y*)

-------------------------------------------------------------------------------

(inline
  (strong
    (strong_begin)
    (content)
    (strong_end)))

===============================================================================
Link: full precedence 1
===============================================================================
[x *][y]*

-------------------------------------------------------------------------------

(inline
  (full_reference_link
    (link_text)
    (link_label)))

===============================================================================
Link: full precedence 2
===============================================================================
*[*][y]

-------------------------------------------------------------------------------

(inline
  (strong
    (strong_begin)
    (content)
    (strong_end)))

===============================================================================
Link: full precedence 3
===============================================================================
*[x][y*]

-------------------------------------------------------------------------------

(inline
  (strong
    (strong_begin)
    (content)
    (strong_end)))

===============================================================================
Link: collapsed precedence 1
===============================================================================
[x *][]*

-------------------------------------------------------------------------------

(inline
  (collapsed_reference_link
    (link_text)))

===============================================================================
Link: collapsed precedence 2
===============================================================================
*[*][]

-------------------------------------------------------------------------------

(inline
  (strong
    (strong_begin)
    (content)
    (strong_end)))

===============================================================================
Link: collapsed precedence 3
===============================================================================
*[x][*]

-------------------------------------------------------------------------------

(inline
  (strong
    (strong_begin)
    (content)
    (strong_end)))

===============================================================================
Link: post precedence inline_link
===============================================================================
[x](y*)*

-------------------------------------------------------------------------------

(inline
  (inline_link
    (link_text)
    (inline_link_destination)))

===============================================================================
Link: post precedence full_reference_link
===============================================================================
[x][y*]*

-------------------------------------------------------------------------------

(inline
  (full_reference_link
    (link_text)
    (link_label)))

===============================================================================
Link: fallback
===============================================================================
[x](/u

-------------------------------------------------------------------------------

(inline)

===============================================================================
Inline attribute: mixed
===============================================================================
text{.one .two #id author="with spaces"}

-------------------------------------------------------------------------------

(inline
  (inline_attribute
    (args
      (class)
      (class)
      (identifier)
      (key_value
        (key)
        (value)))))

===============================================================================
Inline attribute: casing
===============================================================================
text{.snake_case .cebab-case}

-------------------------------------------------------------------------------

(inline
  (inline_attribute
    (args
      (class)
      (class))))

===============================================================================
Inline attribute: key casing
===============================================================================
text{snake_case=2 kebab-case=3}

-------------------------------------------------------------------------------

(inline
  (inline_attribute
    (args
      (key_value
        (key)
        (value))
      (key_value
        (key)
        (value)))))

===============================================================================
Inline attribute: surrounding spaces
===============================================================================
text{ .class }

-------------------------------------------------------------------------------

(inline
  (inline_attribute
    (args
      (class))))

===============================================================================
Inline attribute: with newlines
===============================================================================
text{.one
.two
#three}

-------------------------------------------------------------------------------

(inline
  (inline_attribute
    (args
      (class)
      (class)
      (identifier))))

===============================================================================
Inline attribute: with comment
===============================================================================
text{#ident % later we'll add a class %}

-------------------------------------------------------------------------------

(inline
  (inline_attribute
    (args
      (identifier)
      (comment
        (content)))))

===============================================================================
Inline attribute: comment
===============================================================================
text{%
some text here
%}

-------------------------------------------------------------------------------

(inline
  (inline_attribute
    (args
      (comment
        (content)))))

===============================================================================
Inline attribute: standalone comment
===============================================================================
Foo bar {% This is a comment, spanning
multiple lines %} baz.

-------------------------------------------------------------------------------

(inline
  (comment
    (content)))

===============================================================================
Inline attribute: comment escape %
===============================================================================
Before {% escape \% %}

-------------------------------------------------------------------------------

(inline
  (comment
    (content
      (backslash_escape))))

===============================================================================
Inline attribute: mixed comment escape %
===============================================================================
Before{#id % escape \% %}

-------------------------------------------------------------------------------

(inline
  (inline_attribute
    (args
      (identifier)
      (comment
        (content
          (backslash_escape))))))

===============================================================================
Inline attribute: comment fallback
===============================================================================
Before{%

Before{% Some comment%

{%

-------------------------------------------------------------------------------

(inline)

===============================================================================
Span: With inline attributes
===============================================================================
One [two three]{.class
#id}

-------------------------------------------------------------------------------

(inline
  (span
    (content)
    (inline_attribute
      (args
        (class)
        (identifier)))))

===============================================================================
Span: Precedence
===============================================================================
*[*]{.c} Generates string then an inline attribute

[*]{.c*} The Djot playground doesn't handle this case properly

-------------------------------------------------------------------------------

(inline
  (strong
    (strong_begin)
    (content)
    (strong_end))
  (inline_attribute (args (class)))
  (strong
    (strong_begin)
    (content)
    (strong_end)))

===============================================================================
Span: Precedence prefer span
:skip
===============================================================================

[_]{.c}_

-------------------------------------------------------------------------------

(inline
  (span
    (content)
    (inline_attribute
      (args
        (class)))))

===============================================================================
Span: Precedence choose string with inline attribute
===============================================================================

_[_]{.c}

-------------------------------------------------------------------------------

(inline
  (emphasis
    (emphasis_begin)
    (content)
    (emphasis_end))
  (inline_attribute
    (args
      (class))))

===============================================================================
Span: Broken inline attribute
===============================================================================
[x]{.c
-------------------------------------------------------------------------------

(inline)

===============================================================================
Autolink: simple
===============================================================================
With </url> link

-------------------------------------------------------------------------------

(inline
  (autolink))

===============================================================================
Autolink: fallback
===============================================================================
<

With </url

-------------------------------------------------------------------------------

(inline)

===============================================================================
Footnote: reference
===============================================================================

Here's a ref.[^foo]

-------------------------------------------------------------------------------

(inline
  (footnote_reference
    (footnote_marker_begin)
    (reference_label)
    (footnote_marker_end)))

===============================================================================
Footnote: precedence, prefer emphasis
===============================================================================

_[^foo_]

-------------------------------------------------------------------------------

(inline
  (emphasis
    (emphasis_begin)
    (content)
    (emphasis_end)))

===============================================================================
Footnote: precedence, prefer footnote
===============================================================================

[^foo_]_

-------------------------------------------------------------------------------

(inline
  (footnote_reference
    (footnote_marker_begin)
    (reference_label)
    (footnote_marker_end)))

===============================================================================
Raw inline
===============================================================================
`<? php echo 'yoyo' ?>`{=html}

-------------------------------------------------------------------------------

(inline
  (raw_inline
    (raw_inline_marker_begin)
    (content)
    (raw_inline_marker_end)
    (raw_inline_attribute
      (language))))

===============================================================================
Math: Simple
===============================================================================
$`1 + 2`

-------------------------------------------------------------------------------

(inline
  (math
    (math_marker)
    (math_marker_begin)
    (content)
    (math_marker_end)))

===============================================================================
Math: Close
===============================================================================
$`1 + 2

-------------------------------------------------------------------------------

(inline
  (math
    (math_marker)
    (math_marker_begin)
    (content)
    (math_marker_end)))

===============================================================================
Math: fallback
===============================================================================
$1 $a $$$$

-------------------------------------------------------------------------------

(inline)

===============================================================================
Emphasis: no space next
===============================================================================
_ x_

_x _

-------------------------------------------------------------------------------

(inline)

===============================================================================
Strong: no space next
===============================================================================
* x*

*x *

-------------------------------------------------------------------------------

(inline)

===============================================================================
Inline: broken things
===============================================================================
1 * 2

2 _ 1

~ x

{*x

{=x

{+x

{-x

^x

:x

[x

^

|

:

-

)

[^f

[x](

-------------------------------------------------------------------------------

(inline)

