===============================================================================
Paragraph: simple
===============================================================================
Line

-------------------------------------------------------------------------------

(document (paragraph))

===============================================================================
Paragraph: empty line
===============================================================================
Line

-------------------------------------------------------------------------------

(document (paragraph))

===============================================================================
Paragraph: multiline
===============================================================================
Line1
Line2
Line3

-------------------------------------------------------------------------------

(document (paragraph))

===============================================================================
Paragraph: with words
===============================================================================
Multiple words in paragraph

-------------------------------------------------------------------------------

(document (paragraph))

===============================================================================
Paragraph: two
===============================================================================
First

Second

-------------------------------------------------------------------------------

(document
  (paragraph)
  (paragraph))

===============================================================================
Paragraph: two multiline
===============================================================================
In
First

In
Second

-------------------------------------------------------------------------------

(document
  (paragraph)
  (paragraph))

===============================================================================
Heading: 1
===============================================================================
# Heading

-------------------------------------------------------------------------------
(document
  (section
    (heading (marker) (content))))

===============================================================================
Heading: 2
===============================================================================
## Heading

-------------------------------------------------------------------------------
(document
  (section
    (heading (marker) (content))))

===============================================================================
Heading: very long
===============================================================================
######################################### Heading

-------------------------------------------------------------------------------
(document
  (section
    (heading (marker) (content))))

===============================================================================
Heading: multiple lines
===============================================================================
# Heading
# with
# lines

A paragraph

-------------------------------------------------------------------------------

(document
  (section
    (heading
      (marker)
      (content
        (marker)
        (marker)))
    (section_content (paragraph))))

===============================================================================
Heading: multiple lines no # prefix
===============================================================================
# Heading
with
lines

A paragraph

-------------------------------------------------------------------------------

(document
  (section
    (heading
      (marker)
      (content
        (marker)
        (marker)))
    (section_content (paragraph))))

===============================================================================
Heading 2: multiple lines
===============================================================================
## Heading
with
lines

A paragraph

-------------------------------------------------------------------------------

(document
  (section
    (heading
      (marker)
      (content
        (marker)
        (marker)))
    (section_content (paragraph))))

===============================================================================
Heading: closed by higher heading on the next line
===============================================================================
# One
## Two

-------------------------------------------------------------------------------

(document
  (section
    (heading
      (marker)
      (content))
    (section_content
      (section
        (heading
          (marker)
          (content))))))

===============================================================================
Heading: closed by lower heading on the next line
===============================================================================
## One
# Two

-------------------------------------------------------------------------------

(document
  (section
    (heading
      (marker)
      (content)))
  (section
    (heading
      (marker)
      (content))))

===============================================================================
Heading 4: div closes
===============================================================================
:::
#### Heading
:::

stop

-------------------------------------------------------------------------------

(document
  (div
    (div_marker_begin)
    (content
      (heading (marker) (content)))
    (div_marker_end))
  (paragraph))

===============================================================================
Heading 6: list closes
===============================================================================
###### Heading
- a

-------------------------------------------------------------------------------

(document
  (section
    (heading (marker) (content))
    (section_content
      (list
        (list_item
          (list_marker_dash)
          (list_item_content (paragraph)))))))

===============================================================================
Heading: followed by list
===============================================================================
# Heading

- a

-------------------------------------------------------------------------------

(document
  (section
    (heading (marker) (content))
    (section_content
      (list
        (list_item
          (list_marker_dash)
          (list_item_content (paragraph)))))))

===============================================================================
Section: closed by the same level
===============================================================================
# First

# Second

-------------------------------------------------------------------------------

(document
  (section
    (heading (marker) (content))
    (section_content))
  (section
    (heading (marker) (content))))

===============================================================================
Section: closed by a lower level
===============================================================================
## First

# Second

-------------------------------------------------------------------------------

(document
  (section
    (heading (marker) (content))
    (section_content))
  (section
    (heading (marker) (content))))

===============================================================================
Section: not closed by higher level
===============================================================================
# First

## Second

### Third

-------------------------------------------------------------------------------

(document
  (section
    (heading
      (marker)
      (content))
    (section_content
      (section
        (heading (marker) (content))
        (section_content
          (section
            (heading (marker) (content))))))))

===============================================================================
Section: only allow sections on top level
===============================================================================
# First

- text

  # Second

-------------------------------------------------------------------------------

(document
  (section
    (heading (marker) (content))
    (section_content
      (list
        (list_item
          (list_marker_dash)
          (list_item_content
            (paragraph)
            (heading (marker) (content))))))))

===============================================================================
Block quote: oneline
===============================================================================
> This is a block quote.

-------------------------------------------------------------------------------

(document
  (block_quote
    (block_quote_marker)
    (content
      (paragraph))))

===============================================================================
Block quote: directly after
===============================================================================
> One
> Two
> Three

-------------------------------------------------------------------------------

(document
  (block_quote
    (block_quote_marker)
    (content
      (paragraph
        (block_quote_marker)
        (block_quote_marker)))))

===============================================================================
Block quote: long
===============================================================================
> This is a block quote.
>
> This is included

-------------------------------------------------------------------------------

(document
  (block_quote
    (block_quote_marker)
    (content
      (paragraph)
      (block_quote_marker)
      (block_quote_marker)
      (paragraph))))

===============================================================================
Block quote: lazy
===============================================================================
> This is a block quote.
This is included

-------------------------------------------------------------------------------

(document
  (block_quote
    (block_quote_marker)
    (content
      (paragraph))))

===============================================================================
Block quote: lazy short words
===============================================================================
> abc
def
ghi

-------------------------------------------------------------------------------

(document
  (block_quote
    (block_quote_marker)
    (content
      (paragraph))))

===============================================================================
Block quote: multilevel close nesting
===============================================================================
> > > a
> b

c

-------------------------------------------------------------------------------

(document
  (block_quote
    (block_quote_marker)
    (content
      (block_quote
        (block_quote_marker)
        (content
          (block_quote
            (block_quote_marker)
            (content
              (paragraph)))))
      (block_quote_marker)
      (paragraph)))
  (paragraph))

===============================================================================
Block quote: multilevel nesting with space
===============================================================================
> > a
>
> b

-------------------------------------------------------------------------------

(document
  (block_quote
    (block_quote_marker)
    (content
      (block_quote
        (block_quote_marker)
        (content
          (paragraph)))
      (block_quote_marker)
      (block_quote_marker)
      (paragraph))))

===============================================================================
Block quote: with hard line break
===============================================================================
> a \
> b

-------------------------------------------------------------------------------

(document
  (block_quote
    (block_quote_marker)
    (content
      (paragraph
        (block_quote_marker)))))

===============================================================================
Block quote: contain code block
===============================================================================
> ``` lang
> code

-------------------------------------------------------------------------------

(document
  (block_quote
    (block_quote_marker)
    (content
      (code_block
        (code_block_marker_begin)
        (language)
        (code
          (block_quote_marker))))))

===============================================================================
Code block: without langugae
===============================================================================
```
Some text
here
```

-------------------------------------------------------------------------------

(document
  (code_block
    (code_block_marker_begin)
    (code)
    (code_block_marker_end)))

===============================================================================
Code block: empty
===============================================================================
```
```

-------------------------------------------------------------------------------

(document
  (code_block
    (code_block_marker_begin)
    (code_block_marker_end)))

===============================================================================
Code block: before short paragraph
===============================================================================
```
x
```

z

-------------------------------------------------------------------------------

(document
  (code_block
    (code_block_marker_begin)
    (code)
    (code_block_marker_end))
  (paragraph))

===============================================================================
Code block :lang
===============================================================================
``` rust
Some text
here
```

-------------------------------------------------------------------------------

(document
  (code_block
    (code_block_marker_begin)
    (language)
    (code)
    (code_block_marker_end)))

===============================================================================
Code block: 4 ` escapes 3
===============================================================================
````
x
```
y
````

===============================================================================
Code block: 3 ` escapes 4
===============================================================================
```
x
````
y
```

-------------------------------------------------------------------------------

(document
  (code_block
    (code_block_marker_begin)
    (code)
    (code_block_marker_end)))

===============================================================================
Code block: don't parse heading
===============================================================================
```
# x
```

-------------------------------------------------------------------------------

(document
  (code_block
    (code_block_marker_begin)
    (code)
    (code_block_marker_end)))


===============================================================================
Raw block
===============================================================================
``` =html
<p>txt</p>
```

-------------------------------------------------------------------------------

(document
  (raw_block
    (raw_block_marker_begin)
    (raw_block_info
      (language_marker)
      (language))
    (content)
    (raw_block_marker_end)))

===============================================================================
Thematic break: star
===============================================================================
Before

   *    *    *

After

-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematic_break)
  (paragraph))

===============================================================================
Thematic break: star more
===============================================================================
Before

   *    *    *  * *    * *    *

After

===============================================================================
Thematic break: then paragraph
===============================================================================
***
After

-------------------------------------------------------------------------------

(document
  (thematic_break)
  (paragraph))

===============================================================================
Thematic break: minus
===============================================================================
Before

 - - -

After

-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematic_break)
  (paragraph))

===============================================================================
Thematic break: star 2 + 1
===============================================================================
Before

** * *****

After

-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematic_break)
  (paragraph))


===============================================================================
Thematic break: star 1 + 2
===============================================================================
Before

** *

After

-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematic_break)
  (paragraph))

===============================================================================
Thematic break: minus 3 combined
===============================================================================
Before

---

After

-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematic_break)
  (paragraph))

===============================================================================
Thematic break: minus 2 + 1
===============================================================================
Before

-- - --

After

-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematic_break)
  (paragraph))


===============================================================================
Thematic break: minus 1 + 2
===============================================================================
Before

- -- - --

After

-------------------------------------------------------------------------------

(document
  (paragraph)
  (thematic_break)
  (paragraph))

===============================================================================
Link: ref def
===============================================================================
[ref]: /url

-------------------------------------------------------------------------------

(document
  (link_reference_definition
    (link_label)
    (link_destination)))

===============================================================================
Link: ref def middle
===============================================================================
Some text

[ref]: /url

More text

(document
  (paragraph)
  (link_reference_definition
    (link_label)
    (link_destination))
  (paragraph))

===============================================================================
Link: ref def with emphasis
===============================================================================
[ref_]: /url
[ref_]: /url

-------------------------------------------------------------------------------

(document
  (link_reference_definition
    (link_label)
    (link_destination))
  (link_reference_definition
    (link_label)
    (link_destination)))

===============================================================================
Link: ref def no newlines
===============================================================================
[ref
one]: /url
[ref
two]: /url

-------------------------------------------------------------------------------

(document
  (paragraph))

===============================================================================
Link: ref defs
===============================================================================
Some text

[ref1]: /url
[ref1]: /url
[ref1]: /url

-------------------------------------------------------------------------------

(document
  (paragraph)
  (link_reference_definition
    (link_label)
    (link_destination))
  (link_reference_definition
    (link_label)
    (link_destination))
  (link_reference_definition
    (link_label)
    (link_destination)))


===============================================================================
Block attribute: class
===============================================================================
{.bar}
Paragraph

-------------------------------------------------------------------------------

(document
  (block_attribute
    (args
      (class)))
  (paragraph))

===============================================================================
Block attribute: spaces
===============================================================================
{ .bar }
Paragraph

-------------------------------------------------------------------------------

(document
  (block_attribute
    (args
      (class)))
  (paragraph))

===============================================================================
Block attribute: identifier
===============================================================================
{#id}
Paragraph

-------------------------------------------------------------------------------

(document
  (block_attribute
    (args
      (identifier)))
  (paragraph))

===============================================================================
Block attribute: key value
===============================================================================
{author=value}
Paragraph

-------------------------------------------------------------------------------

(document
  (block_attribute
    (args
      (key_value
        (key)
        (value))))
  (paragraph))

===============================================================================
Block attribute: key value spaces
===============================================================================
{author="with spaces"}
Paragraph

-------------------------------------------------------------------------------

(document
  (block_attribute
    (args
      (key_value
        (key)
        (value))))
  (paragraph))

===============================================================================
Block attribute: mixed
===============================================================================
{.one .two #id author="with spaces"}
Paragraph

-------------------------------------------------------------------------------

(document
  (block_attribute
    (args
      (class)
      (class)
      (identifier)
      (key_value
        (key)
        (value))))
  (paragraph))

===============================================================================
Block attribute: with comment
===============================================================================
{#id % some text here %}
Paragraph

-------------------------------------------------------------------------------

(document
  (block_attribute
    (args
      (identifier)
      (comment (content))))
  (paragraph))

===============================================================================
Block attribute: before heading
===============================================================================
{#new-id}
# Heading

-------------------------------------------------------------------------------

(document
  (block_attribute
    (args
      (identifier)))
  (section
    (heading
      (marker)
      (content))))

===============================================================================
Block attribute: before table
===============================================================================
{#id}
| a | b |

-------------------------------------------------------------------------------

(document
  (block_attribute
    (args
      (identifier)))
  (table
    (table_row
      (table_cell)
      (table_cell))))

===============================================================================
Block attribute: before list
===============================================================================
{#id}
1. List

-------------------------------------------------------------------------------

(document
  (block_attribute
    (args
      (identifier)))
  (list
    (list_item
      (list_marker_decimal_period)
      (list_item_content
        (paragraph)))))

===============================================================================
Block attribute: before blockquote
===============================================================================
{#id}
> Blockquote

-------------------------------------------------------------------------------

(document
  (block_attribute
    (args
      (identifier)))
  (block_quote
    (block_quote_marker)
    (content
      (paragraph))))

===============================================================================
Block attribute: before div
===============================================================================
{#id}
::: div
ok
:::

-------------------------------------------------------------------------------

(document
  (block_attribute
    (args
      (identifier)))
  (div
    (div_marker_begin (class_name))
    (content (paragraph))
    (div_marker_end)))


===============================================================================
Block attribute: before code block
===============================================================================
{#id}
```rust
let x = 2;
```

-------------------------------------------------------------------------------

(document
  (block_attribute
    (args
      (identifier)))
  (code_block
    (code_block_marker_begin)
    (language)
    (code)
    (code_block_marker_end)))

===============================================================================
Block attribute: before link def
===============================================================================
{#id}
[ref]: /url

-------------------------------------------------------------------------------

(document
  (block_attribute
    (args
      (identifier)))
  (link_reference_definition
    (link_label)
    (link_destination)))

===============================================================================
Block attribute: before thematic break
===============================================================================
{#id}
---

-------------------------------------------------------------------------------

(document
  (block_attribute
    (args
      (identifier)))
  (thematic_break))

===============================================================================
Block attribute: inside list
===============================================================================
- Before

  {.class}


-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content
        (paragraph)
        (block_attribute
          (args
            (class)))))))

===============================================================================
Block attribute: inside block quote
===============================================================================
> x
>
> {.class}
> a

-------------------------------------------------------------------------------

(document
  (block_quote
    (block_quote_marker)
    (content
      (paragraph)
      (block_quote_marker)
      (block_quote_marker)
      (block_attribute (args (class)))
      (block_quote_marker)
      (paragraph))))


===============================================================================
Link: inside list
===============================================================================
- [label](#ref)

+ [label](#ref)

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content
        (paragraph))))
  (list
    (list_item
      (list_marker_plus)
      (list_item_content
        (paragraph)))))

===============================================================================
Div: simple
===============================================================================
:::
Inside

:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker_begin)
    (content
      (paragraph))
    (div_marker_end)))

===============================================================================
Div: class
===============================================================================
::: myclass
Inside

:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker_begin
      (class_name))
    (content
      (paragraph))
    (div_marker_end)))

===============================================================================
Div: class_snake
===============================================================================
::: snake_case
Inside

:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker_begin
      (class_name))
    (content
      (paragraph))
    (div_marker_end)))

===============================================================================
Div: kebab-case
===============================================================================
::: kebab-case
Inside

:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker_begin
      (class_name))
    (content
      (paragraph))
    (div_marker_end)))

===============================================================================
Div: end paragraph inside
===============================================================================
:::
Inside
:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker_begin)
    (content
      (paragraph))
    (div_marker_end)))


===============================================================================
Div: eof closes
===============================================================================
:::
Inside

-------------------------------------------------------------------------------

(document
  (div
    (div_marker_begin)
    (content
      (paragraph))))

===============================================================================
Div: nested
===============================================================================
:::
1

::::
2
::::

:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker_begin)
    (content
      (paragraph)
      (div
        (div_marker_begin)
        (content
          (paragraph))
        (div_marker_end)))
    (div_marker_end)))

===============================================================================
Div: close nested div
===============================================================================
:::
1

::::
2

:::

-------------------------------------------------------------------------------

(document
  (div
    (div_marker_begin)
    (content
      (paragraph)
      (div
        (div_marker_begin)
        (content
          (paragraph))))
    (div_marker_end)))

===============================================================================
Div: inside block quote
===============================================================================
> :::
> a
> :::

-------------------------------------------------------------------------------

(document
  (block_quote
    (block_quote_marker)
    (content
      (div
        (div_marker_begin)
        (content
          (paragraph
            (block_quote_marker)))
        (block_quote_marker)
        (div_marker_end)))))

===============================================================================
Paragraph: not recognized
===============================================================================
Before

--

After

-------------------------------------------------------------------------------

(document
  (paragraph)
  (paragraph)
  (paragraph))

===============================================================================
Paragraph :not recognized 2
===============================================================================
Before

-

After

-------------------------------------------------------------------------------

(document
  (paragraph)
  (paragraph)
  (paragraph))

===============================================================================
List: single dash
===============================================================================
- Item

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content (paragraph)))))

===============================================================================
List: tight dashes
===============================================================================
- a
- b
- c

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_dash)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_dash)
      (list_item_content (paragraph)))))

===============================================================================
List: Close sublist
===============================================================================
- a

  - b

- c

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content
        (paragraph)
        (list
          (list_item
            (list_marker_dash)
            (list_item_content
              (paragraph))))))
    (list_item
      (list_marker_dash)
      (list_item_content (paragraph)))))

===============================================================================
List: multiple lists with space between (not separated due to simplicity)
===============================================================================
- a
- b

- x
- y

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_dash)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_dash)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_dash)
      (list_item_content (paragraph)))))

===============================================================================
List: multiple lists with paragraph between
===============================================================================
- a
- b

paragraph

- x
- y

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_dash)
      (list_item_content (paragraph))))
  (paragraph)
  (list
    (list_item
      (list_marker_dash)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_dash)
      (list_item_content (paragraph)))))

===============================================================================
List: Contain unindented paragraph closes list
===============================================================================
- First

Second

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content (paragraph))))
  (paragraph))

===============================================================================
List: Continue paragraph with soft break
===============================================================================
- First
 Second

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content (paragraph)))))

===============================================================================
List: Continue paragraph with lazy indentation
===============================================================================
- First
Second

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content (paragraph)))))

===============================================================================
List: Contain multiple paragraphs
===============================================================================
- First

  Second

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content
        (paragraph)
        (paragraph)))))

===============================================================================
List: Immediate blockquote
===============================================================================
- > a
  > b

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content
        (block_quote
          (block_quote_marker)
          (content
            (paragraph
              (block_quote_marker))))))))

===============================================================================
List: Close contained code block at eof
===============================================================================
- ```
  b

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content
        (code_block
          (code_block_marker_begin)
          (code))))))

===============================================================================
List: Close contained code at next non-indent
===============================================================================
- ```
  a

x

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content
        (code_block
          (code_block_marker_begin)
          (code)))))
  (paragraph))

===============================================================================
List: Close contained multiline code at next non-indent
===============================================================================
- ```
  a

  b

x

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content
        (code_block
          (code_block_marker_begin)
          (code)))))
  (paragraph))

===============================================================================
List: code block should ignore nested list
===============================================================================
- a

  ```
  x: 1
  ```

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content
        (paragraph)
        (code_block
          (code_block_marker_begin)
          (code)
          (code_block_marker_end))))))

===============================================================================
List: raw block at end
===============================================================================
- a

  ```=html
  x
  ```

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content
        (paragraph)
        (raw_block
          (raw_block_marker_begin)
          (raw_block_info
            (language_marker)
            (language))
          (content)
          (raw_block_marker_end))))))

===============================================================================
List: div at end
===============================================================================
- a

  :::
  x
  :::

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content
        (paragraph)
        (div
          (div_marker_begin)
          (content
            (paragraph))
          (div_marker_end))))))

===============================================================================
List: Close contained div at eof
===============================================================================
- ::: mydiv
  a

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content
        (div
          (div_marker_begin
            (class_name))
          (content
            (paragraph)))))))

===============================================================================
List: Close contained div at next non-indent
===============================================================================
- ::: mydiv
  a

x

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content
        (div
          (div_marker_begin
            (class_name))
          (content
            (paragraph))))))
  (paragraph))

===============================================================================
List: With sublist
===============================================================================
- one
- two

  - sub
  - sub

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_dash)
      (list_item_content
        (paragraph)
        (list
          (list_item
            (list_marker_dash)
            (list_item_content (paragraph)))
          (list_item
            (list_marker_dash)
            (list_item_content (paragraph))))))))

===============================================================================
List: plus
===============================================================================
+ one
+ two

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_plus)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_plus)
      (list_item_content (paragraph)))))

===============================================================================
List: star
===============================================================================
* one
* two

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_star)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_star)
      (list_item_content (paragraph)))))

===============================================================================
List: mixed bullets create new lists
===============================================================================
- one
+ two
* tree

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content (paragraph))))
  (list
    (list_item
      (list_marker_plus)
      (list_item_content (paragraph))))
  (list
    (list_item
      (list_marker_star)
      (list_item_content (paragraph)))))

===============================================================================
List: close sublist
===============================================================================
+ one

  + sub

  inner

outer

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_plus)
      (list_item_content
        (paragraph)
        (list
          (list_item
            (list_marker_plus)
            (list_item_content
              (paragraph))))
        (paragraph))))
  (paragraph))

===============================================================================
List: definition
===============================================================================
: term

  Def

  More def

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_definition)
      (term)
      (definition
        (paragraph)
        (paragraph)))))

===============================================================================
List: ordered list markers
===============================================================================
1. x
1. x

1) x
1) x

(1) x
(1) x

a. x
a. x

a) x
a) x

(a) x
(a) x

A. x
A. x

A) x
A) x

(A) x
(A) x

i. x
i. x

i) x
i) x

(i) x
(i) x

I. x
I. x

I) x
I) x

(I) x
(I) x


-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_decimal_period)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_decimal_period)
      (list_item_content (paragraph))))
  (list
    (list_item
      (list_marker_decimal_paren)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_decimal_paren)
      (list_item_content (paragraph))))
  (list
    (list_item
      (list_marker_decimal_parens)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_decimal_parens)
      (list_item_content (paragraph))))
  (list
    (list_item
      (list_marker_lower_alpha_period)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_lower_alpha_period)
      (list_item_content (paragraph))))
  (list
    (list_item
      (list_marker_lower_alpha_paren)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_lower_alpha_paren)
      (list_item_content (paragraph))))
  (list
    (list_item
      (list_marker_lower_alpha_parens)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_lower_alpha_parens)
      (list_item_content (paragraph))))
  (list
    (list_item
      (list_marker_upper_alpha_period)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_upper_alpha_period)
      (list_item_content (paragraph))))
  (list
    (list_item
      (list_marker_upper_alpha_paren)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_upper_alpha_paren)
      (list_item_content (paragraph))))
  (list
    (list_item
      (list_marker_upper_alpha_parens)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_upper_alpha_parens)
      (list_item_content (paragraph))))
  (list
    (list_item
      (list_marker_lower_roman_period)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_lower_roman_period)
      (list_item_content (paragraph))))
  (list
    (list_item
      (list_marker_lower_roman_paren)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_lower_roman_paren)
      (list_item_content (paragraph))))
  (list
    (list_item
      (list_marker_lower_roman_parens)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_lower_roman_parens)
      (list_item_content (paragraph))))
  (list
    (list_item
      (list_marker_upper_roman_period)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_upper_roman_period)
      (list_item_content (paragraph))))
  (list
    (list_item
      (list_marker_upper_roman_paren)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_upper_roman_paren)
      (list_item_content (paragraph))))
  (list
    (list_item
      (list_marker_upper_roman_parens)
      (list_item_content (paragraph)))
    (list_item
      (list_marker_upper_roman_parens)
      (list_item_content (paragraph)))))

===============================================================================
List: close decimal sublist
===============================================================================
1. one

  1. sub

  inner

outer

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_decimal_period)
      (list_item_content
        (paragraph)
        (list
          (list_item
            (list_marker_decimal_period)
            (list_item_content
              (paragraph))))
      (paragraph))))
  (paragraph))

===============================================================================
List: ordered list don't mix
===============================================================================
1. x
1) x
i) x
(a) x

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_decimal_period)
      (list_item_content
        (paragraph))))
  (list
    (list_item
      (list_marker_decimal_paren)
      (list_item_content
        (paragraph))))
  (list
    (list_item
      (list_marker_lower_roman_paren)
      (list_item_content
        (paragraph))))
  (list
    (list_item
      (list_marker_lower_alpha_parens)
      (list_item_content
        (paragraph)))))

===============================================================================
List: task
===============================================================================
- [ ] a
- [x] b
- [X] c

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_task
        (unchecked))
      (list_item_content
        (paragraph)))
    (list_item
      (list_marker_task
        (checked))
      (list_item_content
        (paragraph)))
    (list_item
      (list_marker_task
        (checked))
      (list_item_content
        (paragraph)))))

===============================================================================
List: task mix multiple styles
===============================================================================
* [ ] a
+ [ ] b
- [ ] c

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_task
        (unchecked))
      (list_item_content
        (paragraph)))
    (list_item
      (list_marker_task
        (unchecked))
      (list_item_content
        (paragraph)))
    (list_item
      (list_marker_task
        (unchecked))
      (list_item_content
        (paragraph)))))

===============================================================================
List: not tasks
===============================================================================
- [ ]a

- [x]b

- [X]c

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content
        (paragraph)))
    (list_item
      (list_marker_dash)
      (list_item_content
        (paragraph)))
    (list_item
      (list_marker_dash)
      (list_item_content
        (paragraph)))))

===============================================================================
List: task list closed
===============================================================================
- [ ] a

+ x

- [ ] a

- x

+ [ ] a

* x

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_task
        (unchecked))
      (list_item_content
        (paragraph))))
  (list
    (list_item
      (list_marker_plus)
      (list_item_content
        (paragraph))))
  (list
    (list_item
      (list_marker_task
        (unchecked))
      (list_item_content
        (paragraph))))
  (list
    (list_item
      (list_marker_dash)
      (list_item_content
        (paragraph))))
  (list
    (list_item
      (list_marker_task
        (unchecked))
      (list_item_content
        (paragraph))))
  (list
    (list_item
      (list_marker_star)
      (list_item_content
        (paragraph)))))

===============================================================================
List: double dash
===============================================================================
- -

-------------------------------------------------------------------------------

(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content
        (paragraph)))))

===============================================================================
List: in block quote
===============================================================================
> - a
> - b
> * a
> * b
> + a
> + b
> - [ ] a
> - [x] b

-------------------------------------------------------------------------------
(document
  (block_quote
    (block_quote_marker)
    (content
      (list
        (list_item
          (list_marker_dash)
          (list_item_content
            (paragraph)))
        (list_item
          (block_quote_marker)
          (list_marker_dash)
          (list_item_content
            (paragraph))))
      (block_quote_marker)
      (list
        (list_item
          (list_marker_star)
          (list_item_content
            (paragraph)))
        (list_item
          (block_quote_marker)
          (list_marker_star)
          (list_item_content
            (paragraph))))
      (block_quote_marker)
      (list
        (list_item
          (list_marker_plus)
          (list_item_content
            (paragraph)))
        (list_item
          (block_quote_marker)
          (list_marker_plus)
          (list_item_content
            (paragraph))))
      (block_quote_marker)
      (list
        (list_item
          (list_marker_task
            (unchecked))
          (list_item_content
            (paragraph)))
        (list_item
          (block_quote_marker)
          (list_marker_task
            (checked))
          (list_item_content
            (paragraph)))))))

===============================================================================
List: Sparse list in block quote
===============================================================================
> - a
>
> - b
>

-------------------------------------------------------------------------------
(document
  (block_quote
    (block_quote_marker)
    (content
      (list
        (list_item
          (list_marker_dash)
          (list_item_content
            (paragraph)))
        (list_item
          (block_quote_marker)
          (block_quote_marker)
          (list_marker_dash)
          (list_item_content
            (paragraph))))
      (block_quote_marker))))

===============================================================================
List: List definition in block quote
===============================================================================
> : x
>
>  a

-------------------------------------------------------------------------------
(document
  (block_quote
    (block_quote_marker)
    (content
      (list
        (list_item
          (list_marker_definition)
          (term)
          (definition
            (block_quote_marker)
            (paragraph)))))))

===============================================================================
List: In block quote with paragraph
===============================================================================
> - a
>
>  b

-------------------------------------------------------------------------------
(document
  (block_quote
    (block_quote_marker)
    (content
      (list
        (list_item
          (list_marker_dash)
          (list_item_content
            (paragraph)
            (block_quote_marker)
            (paragraph)))))))

===============================================================================
List: Unclosed List in Blockquote
===============================================================================
> a
>
> - b
-------------------------------------------------------------------------------
(document
  (block_quote
    (block_quote_marker)
    (content
      (paragraph)
      (block_quote_marker)
      (block_quote_marker)
      (list
        (list_item
          (list_marker_dash)
          (list_item_content
            (paragraph)))))))

===============================================================================
List: Unclosed List in Section
===============================================================================
# a

- b
-------------------------------------------------------------------------------
(document
  (section
    (heading
      (marker)
      (content))
    (section_content
      (list
        (list_item
          (list_marker_dash)
          (list_item_content
            (paragraph)))))))

===============================================================================
List: Unclosed List in Div
===============================================================================
::: a

- b
-------------------------------------------------------------------------------
(document
  (div
    (div_marker_begin
      (class_name))
    (content
      (list
        (list_item
          (list_marker_dash)
          (list_item_content
            (paragraph)))))))

===============================================================================
Table: single row
===============================================================================
| a | b |

-------------------------------------------------------------------------------

(document
  (table
    (table_row
      (table_cell)
      (table_cell))))

===============================================================================
Table: before paragraph
===============================================================================
| a | b |

z

-------------------------------------------------------------------------------

(document
  (table
    (table_row
      (table_cell)
      (table_cell)))
  (paragraph))

===============================================================================
Table: initial separator
===============================================================================
|---|---|
| a | b |

-------------------------------------------------------------------------------

(document
  (table
    (table_separator
      (table_cell_alignment)
      (table_cell_alignment))
    (table_row
      (table_cell)
      (table_cell))))

===============================================================================
Table: separator + header
===============================================================================
| x|y|
|--|--:|
| a | b |

-------------------------------------------------------------------------------

(document
  (table
    (table_header
      (table_cell)
      (table_cell))
    (table_separator
      (table_cell_alignment)
      (table_cell_alignment))
    (table_row
      (table_cell)
      (table_cell))))

===============================================================================
Table: separator alignments
===============================================================================
|----|---:|:---|:--:|
| a | b | c | d |

-------------------------------------------------------------------------------

(document
  (table
    (table_separator
      (table_cell_alignment)
      (table_cell_alignment)
      (table_cell_alignment)
      (table_cell_alignment))
    (table_row
      (table_cell)
      (table_cell)
      (table_cell)
      (table_cell))))

===============================================================================
Table: multiple headers
===============================================================================
|1|2|
|-|-|
|3|4|
|-|-|
|a|b|

-------------------------------------------------------------------------------

(document
  (table
    (table_header
      (table_cell)
      (table_cell))
    (table_separator
      (table_cell_alignment)
      (table_cell_alignment))
    (table_header
      (table_cell)
      (table_cell))
    (table_separator
      (table_cell_alignment)
      (table_cell_alignment))
    (table_row
      (table_cell)
      (table_cell))))

===============================================================================
Table: inside blockquote
===============================================================================
> | x|y|
> |--|--:|
> | a | b |

-------------------------------------------------------------------------------

(document
  (block_quote
    (block_quote_marker)
    (content
      (table
        (table_header
          (table_cell)
          (table_cell))
        (table_separator
          (block_quote_marker)
          (table_cell_alignment)
          (table_cell_alignment))
        (table_row
          (block_quote_marker)
          (table_cell)
          (table_cell))))))

===============================================================================
Table: with inline styling
===============================================================================
| _x_ | *y* |

-------------------------------------------------------------------------------

(document
  (table
    (table_row
      (table_cell)
      (table_cell))))

===============================================================================
Table: with caption
===============================================================================
| x | y |
^ caption _here_

Next paragraph

-------------------------------------------------------------------------------

(document
  (table
    (table_row
      (table_cell)
      (table_cell))
    (table_caption
      (marker)
      (content)))
  (paragraph))

===============================================================================
Table: caption early end
===============================================================================
| x | y |
^ caption _here_
Next paragraph

-------------------------------------------------------------------------------

(document
  (table
    (table_row
      (table_cell)
      (table_cell))
    (table_caption
      (marker)
      (content)))
  (paragraph))

===============================================================================
Table: spaced caption
===============================================================================
| x | y |

^ caption here

Next paragraph

-------------------------------------------------------------------------------

(document
  (table
    (table_row
      (table_cell)
      (table_cell))
    (table_caption
      (marker)
      (content)))
  (paragraph))

===============================================================================
Footnote: simple
===============================================================================
[^x]: a

-------------------------------------------------------------------------------

(document
  (footnote
    (footnote_marker_begin)
    (reference_label)
    (footnote_marker_end)
    (footnote_content
      (paragraph))))

===============================================================================
Footnote: before heading
===============================================================================
[^x]: a

# b

-------------------------------------------------------------------------------

(document
  (footnote
    (footnote_marker_begin)
    (reference_label)
    (footnote_marker_end)
    (footnote_content
      (paragraph)))
  (section
    (heading (marker) (content))))

===============================================================================
Footnote: multiline
===============================================================================
[^foo]: Text
that continues

  Next paragraph

-------------------------------------------------------------------------------

(document
  (footnote
    (footnote_marker_begin)
    (reference_label)
    (footnote_marker_end)
    (footnote_content
      (paragraph)
      (paragraph))))

===============================================================================
Footnote: With block quote
===============================================================================
[^foo]: Text

  > block quote inside

-------------------------------------------------------------------------------

(document
  (footnote
    (footnote_marker_begin)
    (reference_label)
    (footnote_marker_end)
    (footnote_content
      (paragraph)
      (block_quote
        (block_quote_marker)
        (content
          (paragraph))))))

===============================================================================
Paragraph: broken things
===============================================================================
|

-

+

*

[x]:

[^f

{.a

{#a

{a=1

{%

{% a

{% a %

-------------------------------------------------------------------------------

(document
  (paragraph)
  (paragraph)
  (paragraph)
  (paragraph)
  (paragraph)
  (paragraph)
  (paragraph)
  (paragraph)
  (paragraph)
  (paragraph)
  (paragraph)
  (paragraph))

===============================================================================
Paragraph: Not list items
===============================================================================
a)s

a.b

1.a

i.e.

(a)(b)

-a

*a

+a

-------------------------------------------------------------------------------

(document
  (paragraph)
  (paragraph)
  (paragraph)
  (paragraph)
  (paragraph)
  (paragraph)
  (paragraph)
  (paragraph))

===============================================================================
Frontmatter
===============================================================================
---
key: Some value
other_key: ["one", "two"]
---

x

-------------------------------------------------------------------------------

(document
  (frontmatter
    (frontmatter_marker)
    (frontmatter_content)
    (frontmatter_marker))
  (paragraph))

===============================================================================
Frontmatter
===============================================================================
---toml
key: Some value
---

x

-------------------------------------------------------------------------------

(document
  (frontmatter
    (frontmatter_marker)
    (language)
    (frontmatter_content)
    (frontmatter_marker))
  (paragraph))

===============================================================================
Heading after list
===============================================================================
- list

# Heading

-------------------------------------------------------------------------------
(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content
        (paragraph))))
  (section
    (heading
      (marker)
      (content))))

===============================================================================
Div in list should be closed before unindented div
===============================================================================
- List

  :::
  nested div

:::
outside div
:::

-------------------------------------------------------------------------------
(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content
        (paragraph)
        (div
          (div_marker_begin)
          (content
            (paragraph))))))
  (div
    (div_marker_begin)
    (content
      (paragraph))
    (div_marker_end)))

===============================================================================
Code block in list should be closed before unindented code block
===============================================================================
- List

  ```
  First code

```
Second code
```

-------------------------------------------------------------------------------
(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content
        (paragraph)
        (code_block
          (code_block_marker_begin)
          (code)))))
  (code_block
    (code_block_marker_begin)
    (code)
    (code_block_marker_end)))

===============================================================================
Raw block in list should be closed before unindented raw block
===============================================================================
- a

  ```=html
  x

```=html
y
```

-------------------------------------------------------------------------------
(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content
        (paragraph)
        (raw_block
          (raw_block_marker_begin)
          (raw_block_info
            (language_marker)
            (language))
          (content)))))
  (raw_block
    (raw_block_marker_begin)
    (raw_block_info
      (language_marker)
      (language))
      (content)
      (raw_block_marker_end)))

===============================================================================
Div in list should be closed before heading
===============================================================================
- List

  :::
  unclosed div

# heading

-------------------------------------------------------------------------------
(document
  (list
    (list_item
      (list_marker_dash)
      (list_item_content
        (paragraph)
        (div
          (div_marker_begin)
          (content
            (paragraph))))))
  (section
    (heading
      (marker)
      (content))))

===============================================================================
Comment before link def
===============================================================================
{% c %}
[def]: /url

-------------------------------------------------------------------------------
(document
  (block_attribute
    (args
      (comment
        (content))))
  (link_reference_definition
    (link_label)
    (link_destination)))

===============================================================================
Comment before heading
===============================================================================
{% c %}
# one

-------------------------------------------------------------------------------
(document
  (block_attribute
    (args
      (comment
        (content))))
  (section
    (heading
      (marker)
      (content))))
